<a href="https://colab.research.google.com/github/MatthewRomanishin/courses/blob/main/My_first_steps/pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/gdrive

# Домашнее задание №2. Pandas

### Общие Правила выполнения дз:
* У функции нельзя менять название
* Можно делать дополнительные функции как внутри исходной функции, так и вне нее
* Можно пользоваться сокращениями `np`, `pd`, `sc` для стандартных библиотек
* Запрещается использовать циклы for и while

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# Здесь надо загрузить данные в переменную data, как в примере внизу
# Что будет, если не указать параметр index_col? Ответ: принт будет по умолчанию
# А если указать там другую колонку? Ответ: Она будет перенесена в начало, т.е. у нее будет "нулевой индекс"
data = pd.read_csv('/content/gdrive/My Drive/Introduction to DS/data/titanic_train.csv', index_col='PassengerId')
data.head()

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S

[5 rows x 11 columns]

```python
data = pd.read_csv('data/titanic_train.csv', index_col='PassengerId')
```

# Характеристики.

Верните среднее, медиану, максимальное и минимальное значение возраста **погибших** мужчин. Именно в данном порядке.

Подсказка: если используете маску - не забудьте поставить выражения в круглые скобки.

In [ ]:
def men_stat(df: pd.DataFrame) -> (float, float, float, float):
    death_men = data[(data['Sex'] == 'male') & (data['Survived'] == 0)]['Age']
    stat = death_men.agg(['mean','median','max','min']).values
    return list(stat)

In [ ]:
men_stat(data)

[31.618055555555557, 29.0, 74.0, 1.0]

# Сводная таблица.

Сделать сводную таблицу по **медианному возрасту** для пола и класса. Для примера посмотрите сводную таблицу по сумме выживших, для пола и класса. 

| Sex        | Pclass  | Survived |
|------------|---------|----------|
| **female** | **1**   |      91  |
|            | **2**   |      70  |
|            | **3**   |      72  |
| **male**   | **1**   |      45  |
|            | **2**   |      17  |
|            | **3**   |      47  |
   
  
Обратите внимание, что первые 2 столбца - это не колонки, а `MultiIndex`.

In [ ]:
def age_stat(df: pd.DataFrame) -> pd.DataFrame:

    stat = data.groupby(['Sex','Pclass',])[['Age']].median()
    return stat

In [ ]:
age_stat(data)

                Age
Sex    Pclass
female 1       35.0
       2       28.0
       3       21.5
male   1       40.0
       2       30.0
       3       25.0

# ПодФрейм Вандермонда.

Для вектора $x=(x_0, \ldots, x_n)$ матрица Вандермона выглядит следующим образом:
$$A = \begin{pmatrix}
1 & x_0 & \cdots & x_0^n \\
1 & x_1 & \cdots & x_1^n \\
\vdots & \ddots & \ddots & \vdots \\
1 & x_n & \cdots &  x_n^n
\end{pmatrix}$$ 

А датафрейм Вандермонда выглядит аналогично:

|       | 0 | 1  |  |n |
|-------|---|----|--|----|
|0      | 1 | $x_0$ | $\ldots$ | $x_0^n$ |
|1      | 1 | $x_1$ | $\ldots$ | $x_1^n$ |
|$\vdots$ | $\vdots$ | $\ddots$ | $\ddots$ | $\vdots$ |
|$n$  | 1 |$x_n$|  | $x_n^n$ |


На вход подается вектор вещественных чисел длины $n+1 > 1$ и две пары индексов. Вам нужно вернуть Фрейм Вандермонда и **под**Фрейм Вандермонда, где первая пара индексов - задает срез по строкам, а вторая пара индексов - срез по колонкам. 

Подсказка: не нужно создавать самим матрицу Вандермонда, она давно реализована за вас в numpy: [np.vander](https://docs.scipy.org/doc/numpy/reference/generated/numpy.vander.html)

#### Input:
```python
x = np.array([3,1,5,4,2])
indices = (0,3)
columns = (2,4)
```
#### **под**Фрейм Вандермонда:

|  | 2 | 3  
|--|---|----
|0 | 9 | 27  
|1 | 1 | 1   
|2 | 25 |125

In [ ]:
def subVander(x: np.ndarray, indices: tuple, columns: tuple) -> (pd.DataFrame, pd.DataFrame):
    vander = pd.DataFrame(np.vander(x, increasing=True))    
    subvander = vander.iloc[indices[0]:indices[1],columns[0]:columns[1]]
    return vander, subvander

In [ ]:
x = np.array([3,1,5,4,2])
indices = (0,3)
columns = (2,4)

vander, sub_vander = subVander(x,indices,columns)
sub_vander

    2    3
0   9   27
1   1    1
2  25  125

In [ ]:
vander

   0  1   2    3    4
0  1  3   9   27   81
1  1  1   1    1    1
2  1  5  25  125  625
3  1  4  16   64  256
4  1  2   4    8   16

In [ ]:
sub_vander

    2    3
0   9   27
1   1    1
2  25  125